## Plan Result (aat)




<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_access_policy.managed_identity_access_policy
  * azurerm_user_assigned_identity.managed_identity
* Update
  * module.azurekeyvault.azurerm_key_vault_access_policy.creator_access_policy
  * module.azurekeyvault.azurerm_monitor_diagnostic_setting.kv-ds




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_access_policy.managed_identity_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-neuvector-aat-rg/providers/Microsoft.KeyVault/vaults/cftneuvector-aat"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # azurerm_user_assigned_identity.managed_identity will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "neuvector-aat-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-aat-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/cft-neuvector"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + tenant_id           = (known after apply)
    }

  # module.azurekeyvault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-neuvector-aat-rg/providers/Microsoft.KeyVault/vaults/cftneuvector-aat/objectId/c822a60c-d948-46f2-a4ce-b1c7ecd33f2f"
      ~ key_permissions         = [
            # (13 unchanged elements hidden)
            "Verify",
          + "GetRotationPolicy",
        ]
        # (6 unchanged attributes hidden)
    }

  # module.azurekeyvault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-neuvector-aat-rg/providers/Microsoft.KeyVault/vaults/cftneuvector-aat|cftneuvector-aat"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "cftneuvector-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":14,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->